app/controllers/calendars_controller.rb

  def show
    events = []
    Appointment.all.each { |event|
---
SELECT * FROM "appointments" ORDER BY appointments.id DESC LIMIT 1